Revit 2024 API
ComponentRepeaterSlot.MakeDefault Method
 Populates the slot with an instance of the default family type of the component repeater.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public void MakeDefault()
Visual Basic
Public Sub MakeDefault
Visual C++
public:
void MakeDefault()
See Also
ComponentRepeaterSlot Class
Autodesk.Revit.DB Namespace